[FunctionHelp]
$casenum9=9@$Casenum@$CASENUM@Current case sequence number. For each case, $CASENUM is the number of cases read up to and including that case. The format is F8.0. The value of $CASENUM is not necessarily the row number in a Data Editor window (available in windowed environments), and the value changes if the file is sorted or new cases are inserted before the end of the file.
$sysmis10=10@$Sysmis@$SYSMIS@System-missing value. The system-missing value displays as a period (.) or whatever is used as the decimal indicator.
$date4=4@$Date@$DATE@Current date in international date format with two-digit year. The format is A9 in the form dd-mmm-yy.
$jdate4=4@$JDate@$JDATE@Current date in number of days from October 14, 1582 (day 1 of the Gregorian calendar). The format is F6.0.
$date114=4@$Date11@$DATE11@Current date in international date format with four-digit year. The format is A11 in the form dd-mmm-yyyy.
$time4=4@$Time@$TIME@Current date and time. $TIME represents the number of seconds from midnight, October 14, 1582, to the date and time when the transformation command is executed. The format is F20. You can display this as a date in a number of different date formats. You can also use it in date and time functions.
abs1=1@Abs@ABS(?)@ABS(numexpr). Numeric. Returns the absolute value of numexpr, which must be numeric.
any13=13@Any@ANY(?,?)@ANY(test,value[,value,...]). Logical. Returns 1 or true if the value of test matches any of the subsequent values; returns 0 or false otherwise. This function requires two or more arguments. For example, ANY(var1, 1, 3, 5) returns 1 if the value of var1 is 1, 3, or 5 and 0 for other values. ANY can also be used to scan a list of variables or expressions for a value. For example, ANY(1, var1, var2, var3) returns 1 if any of the three specified variables has a value of 1 and 0 if all three variables have values other than 1.
applymodel19=19@Applymodel@ApplyModel(?,?,?)@ApplyModel(handle, "function", value). Numeric. Applies a particular scoring function to the input case data using the model specified by handle and where "function" is one of the following string literal values enclosed in quotes: predict, stddev, probability, confidence, nodeid, cumhazard, neighbor, distance. The model handle is the name associated with the external XML file, as defined on the MODEL HANDLE command. The optional third argument applies when the function is "probability", "neighbor", or "distance". For "probability", it specifies a category for which the probability is calculated. For "neighbor" and "distance", it specifies a particular neighbor (as an integer) for nearest neighbor models. ApplyModel returns system-missing if a value can not be computed.
arsin1=1@Arsin@ARSIN(?)@ARSIN(numexpr). Numeric. Returns the inverse sine (arcsine), in radians, of numexpr, which must evaluate to a numeric value between -1 and +1.
artan1=1@Artan@ARTAN(?)@ARTAN(numexpr). Numeric. Returns the inverse tangent (arctangent), in radians, of numexpr, which must be numeric.
cdf.bernoulli2=2@Cdf.Bernoulli@CDF.BERNOULLI(?,?)@CDF.BERNOULLI(quant, prob). Numeric. Returns the cumulative probability that a value from the Bernoulli distribution, with the given probability parameter, will be less than or equal to quant.
cdf.beta2=2@Cdf.Beta@CDF.BETA(?,?,?)@CDF.BETA(quant, shape1, shape2). Numeric. Returns the cumulative probability that a value from the Beta distribution, with the given shape parameters, will be less than quant.
cdf.binom2=2@Cdf.Binom@CDF.BINOM(?,?,?)@CDF.BINOM(quant, n, prob). Numeric. Returns the cumulative probability that the number of successes in n trials, with probability prob of success in each, will be less than or equal to quant. When n is 1, this is the same as CDF.BERNOULLI.
cdf.bvnor2=2@Cdf.Bvnor@CDF.BVNOR(?)@CDF.BVNOR(quant1, quant2, corr). Numeric. Returns the cumulative probability that a value from the standard bivariate normal distribution, with the given correlation parameter, will be less than quant1 and quant2.
cdf.cauchy2=2@Cdf.Cauchy@CDF.CAUCHY(?,?,?)@CDF.CAUCHY(quant, loc, scale). Numeric. Returns the cumulative probability that a value from the Cauchy distribution, with the given location and scale parameters, will be less than quant.
cdf.chisq2=2@Cdf.Chisq@CDF.CHISQ(?,?)@CDF.CHISQ(quant, df). Numeric. Returns the cumulative probability that a value from the chi-square distribution, with df degrees of freedom, will be less than quant.
cdf.exp2=2@Cdf.Exp@CDF.EXP(?,?)@CDF.EXP(quant, scale). Numeric. Returns the cumulative probability that a value from the exponential distribution, with the given scale parameter, will be less than quant.
cdf.f2=2@Cdf.F@CDF.F(?,?,?)@CDF.F(quant, df1, df2). Numeric. Returns the cumulative probability that a value from the F distribution, with degrees of freedom df1 and df2, will be less than quant.
cdf.gamma2=2@Cdf.Gamma@CDF.GAMMA(?,?,?)@CDF.GAMMA(quant, shape, scale). Numeric. Returns the cumulative probability that a value from the Gamma distribution, with the given shape and scale parameters, will be less than quant.
cdf.geom2=2@Cdf.Geom@CDF.GEOM(?,?)@CDF.GEOM(quant, prob). Numeric. Returns the cumulative probability that the number of trials to obtain a success, when the probability of success is given by prob, will be less than or equal to quant.
cdf.halfnrm2=2@Cdf.Halfnrm@CDF.HALFNRM(?)@CDF.HALFNRM(quant, mean, stddev). Numeric. Returns the cumulative probability that a value from the half normal distribution, with specified mean and standard deviation, will be less than quant.
cdf.hyper2=2@Cdf.Hyper@CDF.HYPER(?,?,?,?)@CDF.HYPER(quant, total, sample, hits). Numeric. Returns the cumulative probability that the number of objects with a specified characteristic, when sample objects are randomly selected from a universe of size total in which hits have the specified characteristic, will be less than or equal to quant.
cdf.igauss2=2@Cdf.Igauss@CDF.IGAUSS(?,?,?)@CDF.IGAUSS(quant, loc, scale). Numeric. Returns the cumulative probability that a value from the inverse Gaussian distribution, with the given location and scale parameters, will be less than quant.
cdf.laplace2=2@Cdf.Laplace@CDF.LAPLACE(?,?,?)@CDF.LAPLACE(quant, mean, scale). Numeric. Returns the cumulative probability that a value from the Laplace distribution, with the specified mean and scale parameters, will be less than quant.
cdf.lnormal2=2@Cdf.Lnormal@CDF.LNORMAL(?,?,?)@CDF.LNORMAL(quant, a, b). Numeric. Returns the cumulative probability that a value from the log-normal distribution, with the specified parameters, will be less than quant.
cdf.logistic2=2@Cdf.Logistic@CDF.LOGISTIC(?,?,?)@CDF.LOGISTIC(quant, mean, scale). Numeric. Returns the cumulative probability that a value from the logistic distribution, with the specified mean and scale parameters, will be less than quant.
cdf.negbin2=2@Cdf.Negbin@CDF.NEGBIN(?,?,?)@CDF.NEGBIN(quant, thresh, prob). Numeric. Returns the cumulative probability that the number of trials to obtain a success, when the threshold parameter is thresh and the probability of success is given by prob, will be less than or equal to quant.
cdf.normal2=2@Cdf.Normal@CDF.NORMAL(?,?,?)@CDF.NORMAL(quant, mean, stddev). Numeric. Returns the cumulative probability that a value from the normal distribution, with specified mean and standard deviation, will be less than quant.
cdf.pareto2=2@Cdf.Pareto@CDF.PARETO(?,?,?)@CDF.PARETO(quant, threshold, shape). Numeric. Returns the cumulative probability that a value from the Pareto distribution, with the specified threshold and shape parameters, will be less than quant.
cdf.poisson2=2@Cdf.Poisson@CDF.POISSON(?,?)@CDF.POISSON(quant, mean). Numeric. Returns the cumulative probability that a value from the Poisson distribution, with the specified mean or rate parameter, will be less than or equal to quant.
cdf.smod2=2@Cdf.Smod@CDF.SMOD(?)@CDF.SMOD(quant, a, b). Numeric. Returns the cumulative probability that a value from the Studentized maximum modulus, with the specified parameters, will be less than quant.
cdf.srange2=2@Cdf.Srange@CDF.SRANGE(?)@CDF.SRANGE(quant, a, b). Numeric. Returns the cumulative probability that a value from the Studentized range statistic, with the specified parameters, will be less than quant.
cdf.t2=2@Cdf.T@CDF.T(?,?)@CDF.T(quant, df). Numeric. Returns the cumulative probability that a value from Student's t distribution, with the specified degrees of freedom df, will be less than quant.
cdf.uniform2=2@Cdf.Uniform@CDF.UNIFORM(?,?,?)@CDF.UNIFORM(quant, min, max). Numeric. Returns the cumulative probability that a value from the uniform distribution, with the specified minimum and maximum, will be less than quant.
cdf.weibull2=2@Cdf.Weibull@CDF.WEIBULL(?,?,?)@CDF.WEIBULL(quant, a, b). Numeric. Returns the cumulative probability that a value from the Weibull distribution, with the specified parameters, will be less than quant.
cdfnorm2=2@Cdfnorm@CDFNORM(?)@CDFNORM(zvalue). Numeric. Returns the probability that a random variable with mean 0 and standard deviation 1 would be less than zvalue, which must be numeric.
cfvar15=15@Cfvar@CFVAR(?,?)@CFVAR(numexpr,numexpr[,...]). Numeric. Returns the coefficient of variation (the standard deviation divided by the mean) of its arguments that have valid values. This function requires two or more arguments, which must be numeric. You can specify a minimum number of valid arguments for this function to be evaluated.
char.index(2)16=16@Char.Index(2)@CHAR.INDEX(?,?)@CHAR.INDEX(haystack, needle[, divisor]). Numeric. Returns a number indicating the character position of the first occurrence of needle in haystack. The optional third argument, divisor, is a number of characters used to divide needle into separate strings. Each substring is used for searching and the function returns the first occurrence of any of the substrings. For example, CHAR.INDEX(var1, 'abcd') will return the value of the starting position of the complete string "abcd" in the string variable var1; CHAR.INDEX(var1, 'abcd', 1) will return the value of the position of the first occurrence of any of the values in the string; and CHAR.INDEX(var1, 'abcd', 2) will return the value of the first occurrence of either "ab" or "cd". Divisor must be a positive integer and must divide evenly into the length of needle. Returns 0 if needle does not occur within haystack.
char.index(3)16=16@Char.Index(3)@CHAR.INDEX(?,?,?)@CHAR.INDEX(haystack, needle[, divisor]). Numeric. Returns a number indicating the character position of the first occurrence of needle in haystack. The optional third argument, divisor, is a number of characters used to divide needle into separate strings. Each substring is used for searching and the function returns the first occurrence of any of the substrings. For example, CHAR.INDEX(var1, 'abcd') will return the value of the starting position of the complete string "abcd" in the string variable var1; CHAR.INDEX(var1, 'abcd', 1) will return the value of the position of the first occurrence of any of the values in the string; and CHAR.INDEX(var1, 'abcd', 2) will return the value of the first occurrence of either "ab" or "cd". Divisor must be a positive integer and must divide evenly into the length of needle. Returns 0 if needle does not occur within haystack.
char.index(2)13=13@Char.Index(2)@CHAR.INDEX(?,?)@CHAR.INDEX(haystack, needle[, divisor]). Numeric. Returns a number indicating the character position of the first occurrence of needle in haystack. The optional third argument, divisor, is a number of characters used to divide needle into separate strings. Each substring is used for searching and the function returns the first occurrence of any of the substrings. For example, CHAR.INDEX(var1, 'abcd') will return the value of the starting position of the complete string "abcd" in the string variable var1; CHAR.INDEX(var1, 'abcd', 1) will return the value of the position of the first occurrence of any of the values in the string; and CHAR.INDEX(var1, 'abcd', 2) will return the value of the first occurrence of either "ab" or "cd". Divisor must be a positive integer and must divide evenly into the length of needle. Returns 0 if needle does not occur within haystack.
char.index(3)13=13@Char.Index(3)@CHAR.INDEX(?,?,?)@CHAR.INDEX(haystack, needle[, divisor]). Numeric. Returns a number indicating the character position of the first occurrence of needle in haystack. The optional third argument, divisor, is a number of characters used to divide needle into separate strings. Each substring is used for searching and the function returns the first occurrence of any of the substrings. For example, CHAR.INDEX(var1, 'abcd') will return the value of the starting position of the complete string "abcd" in the string variable var1; CHAR.INDEX(var1, 'abcd', 1) will return the value of the position of the first occurrence of any of the values in the string; and CHAR.INDEX(var1, 'abcd', 2) will return the value of the first occurrence of either "ab" or "cd". Divisor must be a positive integer and must divide evenly into the length of needle. Returns 0 if needle does not occur within haystack.
char.length16=16@Char.Length@CHAR.LENGTH(?)@CHAR.LENGTH(strexpr). Numeric. Returns the length of strexpr in characters, with any trailing blanks removed.
char.lpad(2)16=16@Char.Lpad(2)@CHAR.LPAD(?,?)@CHAR.LPAD(strexpr1,length[,strexpr2]). String. Left-pads strexpr1 to make its length the value specified by length using as many complete copies as will fit of strexpr2 as the padding string. The value of length represents the number of characters and must be a positive integer. If the optional argument strexpr2 is omitted, the value is padded with blank spaces.
char.lpad(3)16=16@Char.Lpad(3)@CHAR.LPAD(?,?,?)@CHAR.LPAD(strexpr1,length[,strexpr2]). String. Left-pads strexpr1 to make its length the value specified by length using as many complete copies as will fit of strexpr2 as the padding string. The value of length represents the number of characters and must be a positive integer. If the optional argument strexpr2 is omitted, the value is padded with blank spaces.
char.mblen16=16@Char.Mblen@CHAR.mblen(?,?)@CHAR.MBLEN(strexpr,pos). Numeric. Returns the number of bytes in the character at character position pos of strexpr.
char.rindex(2)16=16@Char.Rindex(2)@CHAR.RINDEX(?,?)@CHAR.RINDEX(haystack,needle[,divisor]). Numeric. Returns an integer that indicates the starting character position of the last occurrence of the string needle in the string haystack. The optional third argument, divisor, is the number of characters used to divide needle into separate strings. For example, CHAR.RINDEX(var1, 'abcd') will return the starting position of the last occurrence of the entire string "abcd" in the variable var1; CHAR.RINDEX(var1, 'abcd', 1) will return the value of the position of the last occurrence of any of the values in the string; and CHAR.RINDEX(var1, 'abcd', 2) will return the value of the starting position of the last occurrence of either "ab" or "cd". Divisor must be a positive integer and must divide evenly into the length of needle. If needle is not found, the value 0 is returned.
char.rindex(3)16=16@Char.Rindex(3)@CHAR.RINDEX(?,?,?)@CHAR.RINDEX(haystack,needle[,divisor]). Numeric. Returns an integer that indicates the starting character position of the last occurrence of the string needle in the string haystack. The optional third argument, divisor, is the number of characters used to divide needle into separate strings. For example, CHAR.RINDEX(var1, 'abcd') will return the starting position of the last occurrence of the entire string "abcd" in the variable var1; CHAR.RINDEX(var1, 'abcd', 1) will return the value of the position of the last occurrence of any of the values in the string; and CHAR.RINDEX(var1, 'abcd', 2) will return the value of the starting position of the last occurrence of either "ab" or "cd". Divisor must be a positive integer and must divide evenly into the length of needle. If needle is not found, the value 0 is returned.
char.rindex(2)13=13@Char.Rindex(2)@CHAR.RINDEX(?,?)@CHAR.RINDEX(haystack,needle[,divisor]). Numeric. Returns an integer that indicates the starting character position of the last occurrence of the string needle in the string haystack. The optional third argument, divisor, is the number of characters used to divide needle into separate strings. For example, CHAR.RINDEX(var1, 'abcd') will return the starting position of the last occurrence of the entire string "abcd" in the variable var1; CHAR.RINDEX(var1, 'abcd', 1) will return the value of the position of the last occurrence of any of the values in the string; and CHAR.RINDEX(var1, 'abcd', 2) will return the value of the starting position of the last occurrence of either "ab" or "cd". Divisor must be a positive integer and must divide evenly into the length of needle. If needle is not found, the value 0 is returned.
char.rindex(3)13=13@Char.Rindex(3)@CHAR.RINDEX(?,?,?)@CHAR.RINDEX(haystack,needle[,divisor]). Numeric. Returns an integer that indicates the starting character position of the last occurrence of the string needle in the string haystack. The optional third argument, divisor, is the number of characters used to divide needle into separate strings. For example, CHAR.RINDEX(var1, 'abcd') will return the starting position of the last occurrence of the entire string "abcd" in the variable var1; CHAR.RINDEX(var1, 'abcd', 1) will return the value of the position of the last occurrence of any of the values in the string; and CHAR.RINDEX(var1, 'abcd', 2) will return the value of the starting position of the last occurrence of either "ab" or "cd". Divisor must be a positive integer and must divide evenly into the length of needle. If needle is not found, the value 0 is returned.
char.rpad(2)16=16@Char.Rpad(2)@CHAR.RPAD(?,?)@CHAR.RPAD(strexpr1,length[,strexpr2]). String. Right-pads strexpr1 with strexpr2 to extend it to the length given by length using as many complete copies as will fit of strexpr2 as the padding string. The value of length represents the number of characters and must be a positive integer. The optional third argument strexpr2 is a quoted string or an expression that resolves to a string. If strepxr2 is omitted, the value is padded with blanks.
char.rpad(3)16=16@Char.Rpad(3)@CHAR.RPAD(?,?,?)@CHAR.RPAD(strexpr1,length[,strexpr2]). String. Right-pads strexpr1 with strexpr2 to extend it to the length given by length using as many complete copies as will fit of strexpr2 as the padding string. The value of length represents the number of characters and must be a positive integer. The optional third argument strexpr2 is a quoted string or an expression that resolves to a string. If strepxr2 is omitted, the value is padded with blanks.
char.substr(2)16=16@Char.Substr(2)@CHAR.SUBSTR(?,?)@CHAR.SUBSTR(strexpr,pos[,length]). String. Returns the substring beginning at character position pos of strexpr. The optional third argument represents the number of characters in the substring. If the optional argument length is omitted, returns the substring beginning at character position pos of strexpr and running to the end of strexpr. For example CHAR.SUBSTR('abcd', 2) returns 'bcd' and CHAR.SUBSTR('abcd', 2, 2) returns 'bc'.
char.substr(3)16=16@Char.Substr(3)@CHAR.SUBSTR(?,?,?)@CHAR.SUBSTR(strexpr,pos[,length]). String. Returns the substring beginning at character position pos of strexpr. The optional third argument represents the number of characters in the substring. If the optional argument length is omitted, returns the substring beginning at character position pos of strexpr and running to the end of strexpr. For example CHAR.SUBSTR('abcd', 2) returns 'bcd' and CHAR.SUBSTR('abcd', 2, 2) returns 'bc'.
concat16=16@Concat@CONCAT(?,?)@CONCAT(strexpr,strexpr[,..]). String. Returns a string that is the concatenation of all its arguments, which must evaluate to strings. This function requires two or more arguments. In code page mode, if strexpr is a string variable, use RTRIM if you only want the actual string value without the right-padding to the defined variable width. For example, CONCAT(RTRIM(stringvar1), RTRIM(stringvar2)).
cos1=1@Cos@COS(?)@COS(radians). Numeric. Returns the cosine of radians, which must be a numeric value, measured in radians.
ctime.days18=18@Ctime.Days@CTIME.DAYS(?)@CTIME.DAYS(timevalue). Numeric. Returns the number of days, including fractional days, in timevalue, which is a number of seconds, a time expression, or a time format variable.
ctime.hours18=18@Ctime.Hours@CTIME.HOURS(?)@CTIME.HOURS(timevalue). Numeric. Returns the number of hours, including fractional hours, in timevalue, which is a number of seconds, a time expression, or a time format variable.
ctime.minutes18=18@Ctime.Minutes@CTIME.MINUTES(?)@CTIME.MINUTES(timevalue). Numeric. Returns the number of minutes, including fractional minutes, in timevalue, which is a number of seconds, a time expression, or a time format variable.
ctime.seconds18=18@Ctime.Seconds@CTIME.SECONDS(?)@CTIME.SECONDS(timevalue). Numeric. Returns the number of seconds, including fractional seconds, in timevalue, which is a number, a time expression, or a time format variable.
date.dmy6=6@Date.Dmy@DATE.DMY(?,?,?)@DATE.DMY(day,month,year). Numeric. Returns a date value corresponding to the indicated day, month, and year. The arguments must resolve to integers, with day between 1 and 31, month between 1 and 13, and year a four-digit integer greater than 1582. To display the result as a date, assign a date format to the result variable.
date.mdy6=6@Date.Mdy@DATE.MDY(?,?,?)@DATE.MDY(month,day,year). Numeric. Returns a date value corresponding to the indicated month, day, and year. The arguments must resolve to integers, with day between 1 and 31, month between 1 and 13, and year a four-digit integer greater than 1582. To display the result as a date, assign a date format to the result variable.
date.moyr6=6@Date.Moyr@DATE.MOYR(?,?)@DATE.MOYR(month,year). Numeric. Returns a date value corresponding to the indicated month and year. The arguments must resolve to integers, with month between 1 and 13, and year a four-digit integer greater than 1582. To display the result as a date, assign a date format to the result variable.
date.qyr6=6@Date.Qyr@DATE.QYR(?,?)@DATE.QYR(quarter,year). Numeric. Returns a date value corresponding to the indicated quarter and year. The arguments must resolve to integers, with quarter between 1 and 4, and year a four-digit integer greater than 1582. To display the result as a date, assign a date format to the result variable.
date.wkyr6=6@Date.Wkyr@DATE.WKYR(?,?)@DATE.WKYR(weeknum,year). Numeric. Returns a date value corresponding to the indicated weeknum and year. The arguments must resolve to integers, with weeknum between 1 and 53, and year a four-digit integer greater than 1582. The date value returned represents the first day of the specified week for that year. The first week starts on January 1 of each year; so the date returned for any given week value will differ between years. To display the result as a date, assign a date format to the result variable.
date.yrday6=6@Date.Yrday@DATE.YRDAY(?,?)@DATE.YRDAY(year,daynum). Numeric. Returns a date value corresponding to the indicated year and daynum. The arguments must resolve to integers, with daynum between 1 and 366 and with year being a four-digit integer greater than 1582. To display the result as a date, assign a date format to the result variable.
datediff5=5@Datediff@DATEDIFF(?,?,?)@DATEDIFF(datetime2, datetime1, "unit"). Numeric. Calculates the difference between two date/time values and returns an integer (with any fraction component truncated) in the specified date/time units, where datetime2 and datetime1 are both date or time format variables (or numeric values that represent valid date/time values), and "unit" is one of the following string literal values, enclosed in quotes: years, quarters, months, weeks, days, hours, minutes, seconds.
datesum(3)5=5@Datesum(3)@DATESUM(?,?,?)@DATESUM(datetime, value, "unit", "method"). Numeric. Calculates a date or time value a specified number of units from a given date or time value, where datetime is a date or time format variable (or numeric value that represents a valid date/time value), and "unit" is one of the following string literal values, enclosed in quotes: years, quarters, months, weeks, days, hours, minutes, seconds. The optional method, enclosed in quotes, can be "rollover" or "closest". The rollover method advances excess days into the next month. The closest method uses the closest legitimate date within the month; this is the default. The value returned is a date/time value expressed as a number of seconds. To display the value as a date/time, assign the appropriate format to the variable.
datesum(4)5=5@Datesum(4)@DATESUM(?,?,?,?)@DATESUM(datetime, value, "unit", "method"). Numeric. Calculates a date or time value a specified number of units from a given date or time value, where datetime is a date or time format variable (or numeric value that represents a valid date/time value), and "unit" is one of the following string literal values, enclosed in quotes: years, quarters, months, weeks, days, hours, minutes, seconds. The optional method, enclosed in quotes, can be "rollover" or "closest". The rollover method advances excess days into the next month. The closest method uses the closest legitimate date within the month; this is the default. The value returned is a date/time value expressed as a number of seconds. To display the value as a date/time, assign the appropriate format to the variable.
exp1=1@Exp@EXP(?)@EXP(numexpr). Numeric. Returns e raised to the power numexpr, where e is the base of the natural logarithms and numexpr is numeric. Large values of numexpr may produce results that exceed the capacity of the machine.
idf.beta8=8@Idf.Beta@IDF.BETA(?,?,?)@IDF.BETA(prob, shape1, shape2). Numeric. Returns the value from the Beta distribution, with the given shape parameters, for which the cumulative probability is prob.
idf.cauchy8=8@Idf.Cauchy@IDF.CAUCHY(?,?,?)@IDF.CAUCHY(prob, loc, scale). Numeric. Returns the value from the Cauchy distribution, with the given location and scale parameters, for which the cumulative probability is prob.
idf.chisq8=8@Idf.Chisq@IDF.CHISQ(?,?)@IDF.CHISQ(prob, df). Numeric. Returns the value from the chi-square distribution, with the specified degrees of freedom df, for which the cumulative probability is prob. For example, the chi-square value that is significant at the 0.05 level with 3 degrees of freedom is IDF.CHISQ(0.95,3).
idf.exp8=8@Idf.Exp@IDF.EXP(?,?)@IDF.EXP(p, scale). Numeric. Returns the value of an exponentially decaying variable, with rate of decay scale, for which the cumulative probability is p.
idf.f8=8@Idf.F@IDF.F(?,?,?)@IDF.F(prob, df1, df2). Numeric. Returns the value from the F distribution, with the specified degrees of freedom, for which the cumulative probability is prob. For example, the F value that is significant at the 0.05 level with 3 and 100 degrees of freedom is IDF.F(0.95,3,100).
idf.gamma8=8@Idf.Gamma@IDF.GAMMA(?,?,?)@IDF.GAMMA(prob, shape, scale). Numeric. Returns the value from the Gamma distribution, with the specified shape and scale parameters, for which the cumulative probability is prob.
idf.halfnrm8=8@Idf.Halfnrm@IDF.HALFNRM(?)@IDF.HALFNRM(prob, mean, stddev). Numeric. Returns the value from the half normal distribution, with the specified mean and standard deviation, for which the cumulative probability is prob.
idf.igauss8=8@Idf.Igauss@IDF.IGAUSS(?,?,?)@IDF.IGAUSS(prob, loc, scale). Numeric. Returns the value from the inverse Gaussian distribution, with the given location and scale parameters, for which the cumulative probability is prob.
idf.laplace8=8@Idf.Laplace@IDF.LAPLACE(?,?,?)@IDF.LAPLACE(prob, mean, scale). Numeric. Returns the value from the Laplace distribution, with the specified mean and scale parameters, for which the cumulative probability is prob.
idf.lnormal8=8@Idf.Lnormal@IDF.LNORMAL(?,?,?)@IDF.LNORMAL(prob, a, b). Numeric. Returns the value from the log-normal distribution, with specified parameters, for which the cumulative probability is prob.
idf.logistic8=8@Idf.Logistic@IDF.LOGISTIC(?,?,?)@IDF.LOGISTIC(prob, mean, scale). Numeric. Returns the value from the logistic distribution, with specified mean and scale parameters, for which the cumulative probability is prob.
idf.normal8=8@Idf.Normal@IDF.NORMAL(?,?,?)@IDF.NORMAL(prob, mean, stddev). Numeric. Returns the value from the normal distribution, with specified mean and standard deviation, for which the cumulative probability is prob.
idf.pareto8=8@Idf.Pareto@IDF.PARETO(?,?,?)@IDF.PARETO(prob, threshold, shape). Numeric. Returns the value from the Pareto distribution, with specified threshold and scale parameters, for which the cumulative probability is prob.
idf.smod8=8@Idf.Smod@IDF.SMOD(?)@IDF.SMOD(prob, a, b). Numeric. Returns the value from the Studentized maximum modulus, with the specified parameters, for which the cumulative probability is prob.
idf.srange8=8@Idf.Srange@IDF.SRANGE(?)@IDF.SRANGE(prob, a, b). Numeric. Returns the value from the Studentized range statistic, with the specified parameters, for which the cumulative probability is prob.
idf.t8=8@Idf.T@IDF.T(?,?)@IDF.T(prob, df). Numeric. Returns the value from Student's t distribution, with specified degrees of freedom df, for which the cumulative probability is prob.
idf.uniform8=8@Idf.Uniform@IDF.UNIFORM(?,?,?)@IDF.UNIFORM(prob, min, max). Numeric. Returns the value from the uniform distribution between min and max for which the cumulative probability is prob.
idf.weibull8=8@Idf.Weibull@IDF.WEIBULL(?,?,?)@IDF.WEIBULL(prob, a, b). Numeric. Returns the value from the Weibull distribution, with specified parameters, for which the cumulative probability is prob.
lag(1)9=9@Lag(1)@LAG(?)@LAG(variable[, n]). Numeric or string. The value of variable in the previous case or n cases before. The optional second argument, n, must be a positive integer; the default is 1. For example, prev4=LAG(gnp,4) returns the value of gnp for the fourth case before the current one. The first four cases have system-missing values for prev4.
lag(2)9=9@Lag(2)@LAG(?,?)@LAG(variable[, n]). Numeric or string. The value of variable in the previous case or n cases before. The optional second argument, n, must be a positive integer; the default is 1. For example, prev4=LAG(gnp,4) returns the value of gnp for the fourth case before the current one. The first four cases have system-missing values for prev4.
length16=16@Length@LENGTH(?)@LENGTH(strexpr). Numeric. Returns the length of strexpr in bytes, which must be a string expression. For string variables, in Unicode mode this is the number of bytes in each value, excluding trailing blanks, but in code page mode this is the defined variable length, including trailing blanks. To get the length (in bytes) without trailing blanks in code page mode, use LENGTH(RTRIM(strexpr)).
lg101=1@Lg10@LG10(?)@LG10(numexpr). Numeric. Returns the base-10 logarithm of numexpr, which must be numeric and greater than 0.
ln1=1@Ln@LN(?)@LN(numexpr). Numeric. Returns the base-e logarithm of numexpr, which must be numeric and greater than 0.
lngamma1=1@Lngamma@LNGAMMA(?)@LNGAMMA(numexpr). Numeric. Returns the logarithm of the complete Gamma function of numexpr, which must be numeric and greater than 0.
lower16=16@Lower@LOWER(?)@LOWER(strexpr). String. Returns strexpr with uppercase letters changed to lowercase and other characters unchanged. The argument can be a string variable or a value. For example, LOWER(name1) returns charles if the value of name1 is Charles.
ltrim(1)16=16@Ltrim(1)@LTRIM(?)@LTRIM(strexpr[,char]). String. Returns strexpr with any leading instances of char removed. If char is not specified, leading blanks are removed. Char must resolve to a single character.
ltrim(2)16=16@Ltrim(2)@LTRIM(?,?)@LTRIM(strexpr[,char]). String. Returns strexpr with any leading instances of char removed. If char is not specified, leading blanks are removed. Char must resolve to a single character.
max13=13@Max@MAX(?,?)@MAX(value,value[,..]). Numeric or string. Returns the maximum value of its arguments that have valid values. This function requires two or more arguments. For numeric values, you can specify a minimum number of valid arguments for this function to be evaluated.
max15=15@Max@MAX(?,?)@MAX(value,value[,..]). Numeric or string. Returns the maximum value of its arguments that have valid values. This function requires two or more arguments. For numeric values, you can specify a minimum number of valid arguments for this function to be evaluated.
mblen.byte16=16@Mblen.Byte@MBLEN.BYTE(?,?)@MBLEN.BYTE(strexpr,pos). Numeric. Returns the number of bytes in the character at byte position pos of strexpr.
mean15=15@Mean@MEAN(?,?)@MEAN(numexpr,numexpr[,..]). Numeric. Returns the arithmetic mean of its arguments that have valid, nonmissing values. This function requires two or more arguments, which must be numeric. You can specify a minimum number of valid arguments for this function to be evaluated.
median15=15@Median@Median(?,?)@MEDIAN(numexpr,numexpr[,..]). Numeric. Returns the median (50th percentile) of its arguments that have valid, nonmissing values. This function requires two or more arguments, which must be numeric. You can specify a minimum number of valid arguments for this function to be evaluated.
min13=13@Min@MIN(?,?)@MIN(value,value[,..]). Numeric or string. Returns the minimum value of its arguments that have valid, nonmissing values. This function requires two or more arguments. For numeric values, you can specify a minimum number of valid arguments for this function to be evaluated.
min15=15@Min@MIN(?,?)@MIN(value,value[,..]). Numeric or string. Returns the minimum value of its arguments that have valid, nonmissing values. This function requires two or more arguments. For numeric values, you can specify a minimum number of valid arguments for this function to be evaluated.
missing10=10@Missing@MISSING(?)@MISSING(variable). Logical. Returns 1 or true if variable has a system- or user-missing value. The argument should be a variable name in the active dataset.
mod1=1@Mod@MOD(?,?)@MOD(numexpr,modulus). Numeric. Returns the remainder when numexpr is divided by modulus. Both arguments must be numeric, and modulus must not be 0.
ncdf.beta2=2@Ncdf.Beta@NCDF.BETA(?,?,?,?)@NCDF.BETA(quant, shape1, shape2, nc). Numeric. Returns the cumulative probability that a value from the noncentral Beta distribution, with the given shape and noncentrality parameters, will be less than quant.
ncdf.chisq2=2@Ncdf.Chisq@NCDF.CHISQ(?,?,?)@NCDF.CHISQ(quant, df, nc). Numeric. Returns the cumulative probability that a value from the noncentral chi-square distribution, with df degrees of freedom and the specified noncentrality parameter, will be less than quant.
ncdf.f2=2@Ncdf.F@NCDF.F(?,?,?,?)@NCDF.F(quant, df1, df2, nc). Numeric. Returns the cumulative probability that a value from the noncentral F distribution, with degrees of freedom df1 and df2, and noncentrality nc, will be less than quant.
ncdf.t2=2@Ncdf.T@NCDF.T(?,?,?)@NCDF.T(quant, df, nc). Numeric. Returns the cumulative probability that a value from the noncentral Student's t distribution, with the specified degrees of freedom df and noncentrality nc, will be less than quant.
nmiss10=10@Nmiss@NMISS(?)@NMISS(variable[,..]). Numeric. Returns a count of the arguments that have system- and user-missing values. This function requires one or more arguments, which should be variable names in the active dataset.
normalize16=16@Normalize@NORMALIZE(?)@NORMALIZE(strexp). String. Returns the normalized version of strexp. In Unicode mode, it returns Unicode NFC. In code page mode, it has no effect and returns strexp unmodified. The length of the result may be different from the length of the input.
npdf.beta11=11@Npdf.Beta@NPDF.BETA(?,?,?,?)@NPDF.BETA(quant, shape1, shape2, nc). Numeric. Returns the probability density of the noncentral beta distribution, with the given shape and noncentrality parameters, at quant.
npdf.chisq11=11@Npdf.Chisq@NPDF.CHISQ(?,?,?)@NPDF.CHISQ(quant, df, nc). Numeric. Returns the probability density of the noncentral chi-square distribution, with df degrees of freedom and the specified noncentrality parameter, at quant.
npdf.f11=11@Npdf.F@NPDF.F(?,?,?,?)@NPDF.F(quant, df1, df2, nc). Numeric. Returns the probability density of the noncentral F distribution, with degrees of freedom df1 and df2 and noncentrality nc, at quant.
npdf.t11=11@Npdf.T@NPDF.T(?,?,?)@NPDF.T(quant, df, nc). Numeric. Returns the probability density of the noncentral Student's t distribution, with the specified degrees of freedom df and noncentrality nc, at quant.
ntrim16=16@Ntrim@NTRIM(?)@NTRIM(varname). Returns the value of varname, without removing trailing blanks. The value of varname must be a variable name; it cannot be an expression.
number3=3@Number@NUMBER(?,?)@NUMBER(strexpr,format). Numeric. Returns the value of the string expression strexpr as a number. The second argument, format, is the numeric format used to read strexpr. For example, NUMBER(stringDate,DATE11) converts strings containing dates of the general format dd-mmm-yyyy to a numeric number of seconds that represent that date. (To display the value as a date, use the FORMATS or PRINT FORMATS command.) If the string cannot be read using the format, this function returns system-missing.
nvalid10=10@Nvalid@NVALID(?)@NVALID(variable[,..]). Numeric. Returns a count of the arguments that have valid, nonmissing values. This function requires one or more arguments, which should be variable names in the active dataset.
pdf.bernoulli11=11@Pdf.Bernoulli@PDF.BERNOULLI(?,?)@PDF.BERNOULLI(quant, prob). Numeric. Returns the probability that a value from the Bernoulli distribution, with the given probability parameter, will be equal to quant.
pdf.beta11=11@Pdf.Beta@PDF.BETA(?,?,?)@PDF.BETA(quant, shape1, shape2). Numeric. Returns the probability density of the beta distribution, with the given shape parameters, at quant.
pdf.binom11=11@Pdf.Binom@PDF.BINOM(?,?,?)@PDF.BINOM(quant, n, prob). Numeric. Returns the probability that the number of successes in n trials, with probability prob of success in each, will be equal to quant. When n is 1, this is the same as PDF.BERNOULLI.
pdf.bvnor11=11@Pdf.Bvnor@PDF.BVNOR(?,?,?)@PDF.BVNOR(quant1, quant2, corr). Numeric. Returns the probability density of the standard bivariate normal distribution, with the given correlation parameter, at quant1, quant2.
pdf.cauchy11=11@Pdf.Cauchy@PDF.CAUCHY(?,?,?)@PDF.CAUCHY(quant, loc, scale). Numeric. Returns the probability density of the Cauchy distribution, with the given location and scale parameters, at quant.
pdf.chisq11=11@Pdf.Chisq@PDF.CHISQ(?,?)@PDF.CHISQ(quant, df). Numeric. Returns the probability density of the chi-square distribution, with df degrees of freedom, at quant.
pdf.exp11=11@Pdf.Exp@PDF.EXP(?,?)@PDF.EXP(quant, shape). Numeric. Returns the probability density of the exponential distribution, with the given shape parameter, at quant.
pdf.f11=11@Pdf.F@PDF.F(?,?,?)@PDF.F(quant, df1, df2). Numeric. Returns the probability density of the F distribution, with degrees of freedom df1 and df2, at quant.
pdf.gamma11=11@Pdf.Gamma@PDF.GAMMA(?,?,?)@PDF.GAMMA(quant, shape, scale). Numeric. Returns the probability density of the gamma distribution, with the given shape and scale parameters, at quant.
pdf.geom11=11@Pdf.Geom@PDF.GEOM(?,?)@PDF.GEOM(quant, prob). Numeric. Returns the probability that the number of trials to obtain a success, when the probability of success is given by prob, will be equal to quant.
pdf.halfnrm11=11@Pdf.Halfnrm@PDF.HALFNRM(?,?,?)@PDF.HALFNRM(quant, mean, stddev). Numeric. Returns the probability density of the half normal distribution, with specified mean and standard deviation, at quant.
pdf.hyper11=11@Pdf.Hyper@PDF.HYPER(?,?,?,?)@PDF.HYPER(quant, total, sample, hits). Numeric. Returns the probability that the number of objects with a specified characteristic, when sample objects are randomly selected from a universe of size total in which hits have the specified characteristic, will be equal to quant.
pdf.igauss11=11@Pdf.Igauss@PDF.IGAUSS(?,?,?)@PDF.IGAUSS(quant, loc, scale). Numeric. Returns the probability density of the inverse Gaussian distribution, with the given location and scale parameters, at quant.
pdf.laplace11=11@Pdf.Laplace@PDF.LAPLACE(?,?,?)@PDF.LAPLACE(quant, mean, scale). Numeric. Returns the probability density of the Laplace distribution, with the specified mean and scale parameters, at quant.
pdf.lnormal11=11@Pdf.Lnormal@PDF.LNORMAL(?,?,?)@PDF.LNORMAL(quant, a, b). Numeric. Returns the probability density of the log-normal distribution, with the specified parameters, at quant.
pdf.logistic11=11@Pdf.Logistic@PDF.LOGISTIC(?,?,?)@PDF.LOGISTIC(quant, mean, scale). Numeric. Returns the probability density of the logistic distribution, with the specified mean and scale parameters, at quant.
pdf.negbin11=11@Pdf.Negbin@PDF.NEGBIN(?,?,?)@PDF.NEGBIN(quant, thresh, prob). Numeric. Returns the probability that the number of trials to obtain a success, when the threshold parameter is thresh and the probability of success is given by prob, will be equal to quant.
pdf.normal11=11@Pdf.Normal@PDF.NORMAL(?,?,?)@PDF.NORMAL(quant, mean, stddev). Numeric. Returns the probability density of the normal distribution, with specified mean and standard deviation, at quant.
pdf.pareto11=11@Pdf.Pareto@PDF.PARETO(?,?,?)@PDF.PARETO(quant, threshold, shape). Numeric. Returns the probability density of the Pareto distribution, with the specified threshold and shape parameters, at quant.
pdf.poisson11=11@Pdf.Poisson@PDF.POISSON(?,?)@PDF.POISSON(quant, mean). Numeric. Returns the probability that a value from the Poisson distribution, with the specified mean or rate parameter, will be equal to quant.
pdf.t11=11@Pdf.T@PDF.T(?,?)@PDF.T(quant, df). Numeric. Returns the probability density of Student's t distribution, with the specified degrees of freedom df, at quant.
pdf.uniform11=11@Pdf.Uniform@PDF.UNIFORM(?,?,?)@PDF.UNIFORM(quant, min, max). Numeric. Returns the probability density of the uniform distribution, with the specified minimum and maximum, at quant.
pdf.weibull11=11@Pdf.Weibull@PDF.WEIBULL(?,?,?)@PDF.WEIBULL(quant, a, b). Numeric. Returns the probability density of the Weibull distribution, with the specified parameters, at quant.
range13=13@Range@RANGE(?,?,?)@RANGE(test,lo,hi[,lo,hi,..]). Logical. Returns 1 or true if test is within any of the inclusive range(s) defined by the pairs lo, hi. Arguments must be all numeric or all strings of the same length, and each of the lo, hi pairs must be ordered with lo <= hi. Note: For string values, results can vary by locale even for the same set of characters, since the national collating sequence is used. Language order, not ASCII order, determines where certain characters fall in the sequence.
replace(3)13=13@Replace(3)@REPLACE(?,?,?)@REPLACE(a1, a2, a3[, a4]). String. In a1, instances of a2 are replaced with a3. The optional argument a4 specifies the number of occurrences to replace; if a4 is omitted, all occurrences are replaced. Arguments a1, a2, and a3 must resolve to string values (literal strings enclosed in quotes or string variables), and the optional argument a4 must resolve to a non-negative integer. For example, REPLACE("abcabc", "a", "x") returns a value of "xbcxbc" and REPLACE("abcabc", "a", "x", 1) returns a value of "xbcabc".
replace(4)13=13@Replace(4)@REPLACE(?,?,?,?)@REPLACE(a1, a2, a3[, a4]). String. In a1, instances of a2 are replaced with a3. The optional argument a4 specifies the number of occurrences to replace; if a4 is omitted, all occurrences are replaced. Arguments a1, a2, and a3 must resolve to string values (literal strings enclosed in quotes or string variables), and the optional argument a4 must resolve to a non-negative integer. For example, REPLACE("abcabc", "a", "x") returns a value of "xbcxbc" and REPLACE("abcabc", "a", "x", 1) returns a value of "xbcabc".
replace(3)16=16@Replace(3)@REPLACE(?,?,?)@REPLACE(a1, a2, a3[, a4]). String. In a1, instances of a2 are replaced with a3. The optional argument a4 specifies the number of occurrences to replace; if a4 is omitted, all occurrences are replaced. Arguments a1, a2, and a3 must resolve to string values (literal strings enclosed in quotes or string variables), and the optional argument a4 must resolve to a non-negative integer. For example, REPLACE("abcabc", "a", "x") returns a value of "xbcxbc" and REPLACE("abcabc", "a", "x", 1) returns a value of "xbcabc".
replace(4)16=16@Replace(4)@REPLACE(?,?,?,?)@REPLACE(a1, a2, a3[, a4]). String. In a1, instances of a2 are replaced with a3. The optional argument a4 specifies the number of occurrences to replace; if a4 is omitted, all occurrences are replaced. Arguments a1, a2, and a3 must resolve to string values (literal strings enclosed in quotes or string variables), and the optional argument a4 must resolve to a non-negative integer. For example, REPLACE("abcabc", "a", "x") returns a value of "xbcxbc" and REPLACE("abcabc", "a", "x", 1) returns a value of "xbcabc".
rnd(1)1=1@Rnd(1)@RND(?)@RND(numexpr[,mult,fuzzbits]). Numeric. With a single argument, returns the integer nearest to that argument. Numbers ending in .5 exactly are rounded away from 0. For example, RND(-4.5) rounds to -5. The optional second argument, mult, specifies that the result is an integer multiple of this value—for example, RND(-4.57,0.1) = -4.6. The value must be numeric but cannot be 0. The default is 1. The optional third argument, fuzzbits, is the number of least-significant bits by which numexpr may fall short of the threshold for rounding up (e.g., 0.5 when rounding to an integer) but still be rounded up. If omitted, the system setting of FUZZBITS (set to 6 at install time) is used.
rnd(2)1=1@Rnd(2)@RND(?,?)@RND(numexpr[,mult,fuzzbits]). Numeric. With a single argument, returns the integer nearest to that argument. Numbers ending in .5 exactly are rounded away from 0. For example, RND(-4.5) rounds to -5. The optional second argument, mult, specifies that the result is an integer multiple of this value—for example, RND(-4.57,0.1) = -4.6. The value must be numeric but cannot be 0. The default is 1. The optional third argument, fuzzbits, is the number of least-significant bits by which numexpr may fall short of the threshold for rounding up (e.g., 0.5 when rounding to an integer) but still be rounded up. If omitted, the system setting of FUZZBITS (set to 6 at install time) is used.
rnd(3)1=1@Rnd(3)@RND(?,?,?)@RND(numexpr[,mult,fuzzbits]). Numeric. With a single argument, returns the integer nearest to that argument. Numbers ending in .5 exactly are rounded away from 0. For example, RND(-4.5) rounds to -5. The optional second argument, mult, specifies that the result is an integer multiple of this value—for example, RND(-4.57,0.1) = -4.6. The value must be numeric but cannot be 0. The default is 1. The optional third argument, fuzzbits, is the number of least-significant bits by which numexpr may fall short of the threshold for rounding up (e.g., 0.5 when rounding to an integer) but still be rounded up. If omitted, the system setting of FUZZBITS (set to 6 at install time) is used.
rtrim(1)16=16@Rtrim(1)@RTRIM(?)@RTRIM(strexpr[,char]). String. Trims trailing instances of char within strexpr. The optional second argument char is a single quoted character or an expression that yields a single character. If char is omitted, trailing blanks are trimmed.
rtrim(2)16=16@Rtrim(2)@RTRIM(?,?)@RTRIM(strexpr[,char]). String. Trims trailing instances of char within strexpr. The optional second argument char is a single quoted character or an expression that yields a single character. If char is omitted, trailing blanks are trimmed.
rv.bernoulli12=12@Rv.Bernoulli@RV.BERNOULLI(?)@RV.BERNOULLI(prob). Numeric. Returns a random value from a Bernoulli distribution with the specified probability parameter prob.
rv.beta12=12@Rv.Beta@RV.BETA(?,?)@RV.BETA(shape1, shape2). Numeric. Returns a random value from a Beta distribution with specified shape parameters.
rv.binom12=12@Rv.Binom@RV.BINOM(?,?)@RV.BINOM(n, prob). Numeric. Returns a random value from a binomial distribution with specified number of trials and probability parameter.
rv.cauchy12=12@Rv.Cauchy@RV.CAUCHY(?,?)@RV.CAUCHY(loc, scale). Numeric. Returns a random value from a Cauchy distribution with specified location and scale parameters.
rv.chisq12=12@Rv.Chisq@RV.CHISQ(?)@RV.CHISQ(df). Numeric. Returns a random value from a chi-square distribution with specified degrees of freedom df.
rv.exp12=12@Rv.Exp@RV.EXP(?)@RV.EXP(scale). Numeric. Returns a random value from an exponential distribution with specified scale parameter.
rv.f12=12@Rv.F@RV.F(?,?)@RV.F(df1, df2). Numeric. Returns a random value from an F distribution with specified degrees of freedom, df1 and df2.
rv.gamma12=12@Rv.Gamma@RV.GAMMA(?,?)@RV.GAMMA(shape, scale). Numeric. Returns a random value from a Gamma distribution with specified shape and scale parameters.
rv.geom12=12@Rv.Geom@RV.GEOM(?)@RV.GEOM(prob). Numeric. Returns a random value from a geometric distribution with specified probability parameter.
rv.halfnrm12=12@Rv.Halfnrm@RV.HALFNRM(?)@RV.HALFNRM(mean, stddev). Numeric. Returns a random value from a half normal distribution with the specified mean and standard deviation.
rv.hyper12=12@Rv.Hyper@RV.HYPER(?,?,?)@RV.HYPER(total, sample, hits). Numeric. Returns a random value from a hypergeometric distribution with specified parameters.
rv.igauss12=12@Rv.Igauss@RV.IGAUSS(?,?)@RV.IGAUSS(loc, scale). Numeric. Returns a random value from an inverse Gaussian distribution with the specified location and scale parameters.
rv.laplace12=12@Rv.Laplace@RV.LAPLACE(?,?)@RV.LAPLACE(mean, scale). Numeric. Returns a random value from a Laplace distribution with specified mean and scale parameters.
rv.lnormal12=12@Rv.Lnormal@RV.LNORMAL(?,?)@RV.LNORMAL(a, b). Numeric. Returns a random value from a log-normal distribution with specified parameters.
rv.logistic12=12@Rv.Logistic@RV.LOGISTIC(?,?)@RV.LOGISTIC(mean, scale). Numeric. Returns a random value from a logistic distribution with specified mean and scale parameters.
rv.negbin12=12@Rv.Negbin@RV.NEGBIN(?,?)@RV.NEGBIN(threshold, prob). Numeric. Returns a random value from a negative binomial distribution with specified threshold and probability parameters.
rv.normal12=12@Rv.Normal@RV.NORMAL(?,?)@RV.NORMAL(mean, stddev). Numeric. Returns a random value from a normal distribution with specified mean and standard deviation.
rv.pareto12=12@Rv.Pareto@RV.PARETO(?,?)@RV.PARETO(threshold, shape). Numeric. Returns a random value from a Pareto distribution with specified threshold and shape parameters.
rv.poisson12=12@Rv.Poisson@RV.POISSON(?)@RV.POISSON(mean). Numeric. Returns a random value from a Poisson distribution with specified mean/rate parameter.
rv.t12=12@Rv.T@RV.T(?)@RV.T(df). Numeric. Returns a random value from a Student's t distribution with specified degrees of freedom df.
rv.uniform12=12@Rv.Uniform@RV.UNIFORM(?,?)@RV.UNIFORM(min, max). Numeric. Returns a random value from a uniform distribution with specified minimum and maximum. See also the UNIFORM function.
rv.weibull12=12@Rv.Weibull@RV.WEIBULL(?,?)@RV.WEIBULL(a, b). Numeric. Returns a random value from a Weibull distribution with specified parameters.
sd15=15@Sd@SD(?,?)@SD(numexpr,numexpr[,..]). Numeric. Returns the standard deviation of its arguments that have valid, nonmissing values. This function requires two or more arguments, which must be numeric. You can specify a minimum number of valid arguments for this function to be evaluated.
sig.chisq14=14@Sig.Chisq@SIG.CHISQ(?)@SIG.CHISQ(quant, df). Numeric. Returns the cumulative probability that a value from the chi-square distribution, with df degrees of freedom, will be greater than quant
sig.f14=14@Sig.F@SIG.F(?)@SIG.F(quant, df1, df2). Numeric. Returns the cumulative probability that a value from the F distribution, with degrees of freedom df1 and df2, will be greater than quant.
sin1=1@Sin@SIN(?)@SIN(radians). Numeric. Returns the sine of radians, which must be a numeric value, measured in radians.
sqrt1=1@Sqrt@SQRT(?)@SQRT(numexpr). Numeric. Returns the positive square root of numexpr, which must be numeric and not negative.
strapplymodel19=19@Strapplymodel@StrApplyModel(?,?,?)@StrApplyModel(handle, "function", value). String. Applies a particular scoring function to the input case data using the model specified by handle and where "function" is one of the following string literal values enclosed in quotes: predict, stddev, probability, confidence, nodeid, cumhazard, neighbor, distance. The model handle is the name associated with the external XML file, as defined on the MODEL HANDLE command. The optional third argument applies when the function is "probability", "neighbor", or "distance". For "probability", it specifies a category for which the probability is calculated. For "neighbor" and "distance", it specifies a particular neighbor (as an integer) for nearest neighbor models. StrApplyModel returns a blank string if a value cannot be computed.
string3=3@String@STRING(?,?)@STRING(numexpr,format). String. Returns the string that results when numexpr is converted to a string according to format. STRING(-1.5,F5.2) returns the string value '-1.50'. The second argument format must be a format for writing a numeric value.
strunc16=16@Strunc@STRUNC(?,?)@STRUNC(strexp, length). String. Returns strexp truncated to length (in bytes) and then trimmed of any trailing blanks. Truncation removes any fragment of a character that would be truncated.
sum15=15@Sum@SUM(?,?)@SUM(numexpr,numexpr[,..]). Numeric. Returns the sum of its arguments that have valid, nonmissing values. This function requires two or more arguments, which must be numeric. You can specify a minimum number of valid arguments for this function to be evaluated.
sysmis10=10@Sysmis@SYSMIS(?)@SYSMIS(numvar). Logical. Returns 1 or true if the value of numvar is system-missing. The argument numvar must be the name of a numeric variable in the active dataset.
time.days17=17@Time.Days@TIME.DAYS(?)@TIME.DAYS(days). Numeric. Returns a time interval corresponding to the indicated number of days. The argument must be numeric. To display the result as a time, assign a time format to the result variable.
time.hms(1)17=17@Time.Hms(1)@TIME.HMS(?)@TIME.HMS(hours[,minutes,seconds]). Numeric. Returns a time interval corresponding to the indicated number of hours, minutes, and seconds. The minutes and seconds arguments are optional. Minutes and seconds must resolve to numbers less than 60 if any higher-order argument is non-zero. All arguments except the last non-zero argument must resolve to integers. For example TIME.HMS(25.5) and TIME.HMS(0,90,25.5) are valid, while TIME.HMS(25.5,30) and TIME.HMS(25,90) are invalid. All arguments must resolve to either all positive or all negative values. To display the result as a time, assign a time format to the result variable.
time.hms(2)17=17@Time.Hms(2)@TIME.HMS(?,?)@TIME.HMS(hours[,minutes,seconds]). Numeric. Returns a time interval corresponding to the indicated number of hours, minutes, and seconds. The minutes and seconds arguments are optional. Minutes and seconds must resolve to numbers less than 60 if any higher-order argument is non-zero. All arguments except the last non-zero argument must resolve to integers. For example TIME.HMS(25.5) and TIME.HMS(0,90,25.5) are valid, while TIME.HMS(25.5,30) and TIME.HMS(25,90) are invalid. All arguments must resolve to either all positive or all negative values. To display the result as a time, assign a time format to the result variable.
time.hms(3)17=17@Time.Hms(3)@TIME.HMS(?,?,?)@TIME.HMS(hours[,minutes,seconds]). Numeric. Returns a time interval corresponding to the indicated number of hours, minutes, and seconds. The minutes and seconds arguments are optional. Minutes and seconds must resolve to numbers less than 60 if any higher-order argument is non-zero. All arguments except the last non-zero argument must resolve to integers. For example TIME.HMS(25.5) and TIME.HMS(0,90,25.5) are valid, while TIME.HMS(25.5,30) and TIME.HMS(25,90) are invalid. All arguments must resolve to either all positive or all negative values. To display the result as a time, assign a time format to the result variable.
trunc(1)1=1@Trunc(1)@TRUNC(?)@TRUNC(numexpr[,mult,fuzzbits]). Numeric. Returns the value of numexpr truncated toward 0. The optional second argument, mult, specifies that the result is an integer multiple of this value—for example, TRUNC(4.579,0.1) = 4.5. The value must be numeric but cannot be 0. The default is 1. The optional third argument, fuzzbits, is the number of least-significant bits by which numexpr may fall short of the nearest rounding boundary and be rounded up before truncating. For example, if numexpr is between 1.4 and 1.5 and mult is 0.1 then fuzzbits specifies how close numexpr can be to 1.5 (the nearest boundary) and be rounded up. If omitted, the system setting of FUZZBITS (set to 6 at install time) is used.
trunc(2)1=1@Trunc(2)@TRUNC(?,?)@TRUNC(numexpr[,mult,fuzzbits]). Numeric. Returns the value of numexpr truncated toward 0. The optional second argument, mult, specifies that the result is an integer multiple of this value—for example, TRUNC(4.579,0.1) = 4.5. The value must be numeric but cannot be 0. The default is 1. The optional third argument, fuzzbits, is the number of least-significant bits by which numexpr may fall short of the nearest rounding boundary and be rounded up before truncating. For example, if numexpr is between 1.4 and 1.5 and mult is 0.1 then fuzzbits specifies how close numexpr can be to 1.5 (the nearest boundary) and be rounded up. If omitted, the system setting of FUZZBITS (set to 6 at install time) is used.
trunc(3)1=1@Trunc(3)@TRUNC(?,?,?)@TRUNC(numexpr[,mult,fuzzbits]). Numeric. Returns the value of numexpr truncated toward 0. The optional second argument, mult, specifies that the result is an integer multiple of this value—for example, TRUNC(4.579,0.1) = 4.5. The value must be numeric but cannot be 0. The default is 1. The optional third argument, fuzzbits, is the number of least-significant bits by which numexpr may fall short of the nearest rounding boundary and be rounded up before truncating. For example, if numexpr is between 1.4 and 1.5 and mult is 0.1 then fuzzbits specifies how close numexpr can be to 1.5 (the nearest boundary) and be rounded up. If omitted, the system setting of FUZZBITS (set to 6 at install time) is used.
upcase16=16@Upcase@UPCASE(?)@UPCASE(strexpr). String. Returns strexpr with lowercase letters changed to uppercase and other characters unchanged.
value10=10@Value@VALUE(?)@VALUE(variable). Numeric or string. Returns the value of variable, ignoring user missing-value definitions for variable, which must be a variable name or a vector reference to a variable name.
valuelabel9=9@Valuelabel@VALUELABEL(?)@VALUELABEL(varname). String. Returns the value label for the value of variable or an empty string if there is no label for the value. The value of varname must be a variable name; it cannot be an expression.
variance15=15@Variance@VARIANCE(?,?)@VARIANCE(numexpr,numexpr[,..]). Numeric. Returns the variance of its arguments that have valid values. This function requires two or more arguments, which must be numeric. You can specify a minimum number of valid arguments for this function to be evaluated.
xdate.date7=7@Xdate.Date@XDATE.DATE(?)@XDATE.DATE(datevalue). Numeric. Returns the date portion from a numeric value that represents a date. The argument can be a number, a date format variable, or an expression that resolves to a date. To display the result as a date, apply a date format to the variable.
xdate.hour18=18@Xdate.Hour@XDATE.HOUR(?)@XDATE.HOUR(datetime). Numeric. Returns the hour (an integer between 0 and 23) from a value that represents a time or a datetime. The argument can be a number, a time or datetime variable or an expression that resolves to a time or datetime value.
xdate.jday7=7@Xdate.Jday@XDATE.JDAY(?)@XDATE.JDAY(datevalue). Numeric. Returns the day of the year (an integer between 1 and 366) from a numeric value that represents a date. The argument can be a number, a date format variable, or an expression that resolves to a date.
xdate.mday7=7@Xdate.Mday@XDATE.MDAY(?)@XDATE.MDAY(datevalue). Numeric. Returns the day of the month (an integer between 1 and 31) from a numeric value that represents a date. The argument can be a number, a date format variable, or an expression that resolves to a date.
xdate.minute18=18@Xdate.Minute@XDATE.MINUTE(?)@XDATE.MINUTE(datetime). Numeric. Returns the minute (an integer between 0 and 59) from a value that represents a time or a datetime. The argument can be a number, a time or datetime variable, or an expression that resolves to a time or datetime value.
xdate.month7=7@Xdate.Month@XDATE.MONTH(?)@XDATE.MONTH(datevalue). Numeric. Returns the month (an integer between 1 and 12) from a numeric value that represents a date. The argument can be a number, a date format variable, or an expression that resolves to a date.
xdate.quarter7=7@Xdate.Quarter@XDATE.QUARTER(?)@XDATE.QUARTER(datevalue). Numeric. Returns the quarter of the year (an integer between 1 and 4) from a numeric value that represents a date. The argument can be a number, a date format variable, or an expression that resolves to a date.
xdate.second18=18@Xdate.Second@XDATE.SECOND(?)@XDATE.SECOND(datetime). Numeric. Returns the second (a number between 0 and 60) from a value that represents a time or a datetime. The argument can be a number, a time or datetime variable or an expression that resolves to a time or datetime value.
xdate.tday7=7@Xdate.Tday@XDATE.TDAY(?)@XDATE.TDAY(timevalue). Numeric. Returns the number of whole days (as an integer) from a numeric value that represents a time interval. The argument can be a number, a time format variable, or an expression that resolves to a time interval.
xdate.tday18=18@Xdate.Tday@XDATE.TDAY(?)@XDATE.TDAY(timevalue). Numeric. Returns the number of whole days (as an integer) from a numeric value that represents a time interval. The argument can be a number, a time format variable, or an expression that resolves to a time interval.
xdate.time7=7@Xdate.Time@XDATE.TIME(?)@XDATE.TIME(datetime). Numeric. Returns the time portion from a value that represents a time or a datetime. The argument can be a number, a time or datetime variable or an expression that resolves to a time or datetime value. To display the result as a time, apply a time format to the variable.
xdate.week7=7@Xdate.Week@XDATE.WEEK(?)@XDATE.WEEK(datevalue). Numeric. Returns the week number (an integer between 1 and 53) from a numeric value that represents a date. The argument can be a number, a date format variable, or an expression that resolves to a date.
xdate.wkday7=7@Xdate.Wkday@XDATE.WKDAY(?)@XDATE.WKDAY(datevalue). Numeric. Returns the day-of-week number (an integer between 1, Sunday, and 7, Saturday) from a numeric value that represents a date. The argument can be a number, a date format variable, or an expression that resolves to a date.
xdate.year7=7@Xdate.Year@XDATE.YEAR(?)@XDATE.YEAR(datevalue). Numeric. Returns the year (as a four-digit integer) from a numeric value that represents a date. The argument can be a number, a date format variable, or an expression that resolves to a date.
yrmoda7=7@Yrmoda@YRMODA(?,?,?)@YRMODA(year,month,day). Numeric. Returns the number of days from October 15, 1582 to the date represented by the arguments year, month, and day, which must be integers that form a valid date since October 15, 1582. Two-digit values of year assume a century based on Options settings (Edit menu, Options, Data tab). By default, 2-digit years assume a range beginning 69 years prior to the current date and ending 30 years after the current date..
